app/controllers/debtors_controller.rb

  def index
    @debtors = Debtor.find :all,
                           :conditions => ["user_id = ? and (updated_at is null or Date_Format(updated_at, '%Y-%m-%d') <> ?)", session[:id], DateTime::now().strftime("%Y-%m-%d")]
---
SELECT * FROM `debtors` WHERE (user_id = 2 and (updated_at is null or Date_Format(updated_at, '%Y-%m-%d') <> '2009-07-29'))

  def show
    @debtor = Debtor.find params[:id]
---
SELECT * FROM `debtors` WHERE (`debtors`.`id` = 1)

  def update
    @debtor = Debtor.find params[:id]
---
SELECT * FROM `debtors` WHERE (`debtors`.`id` = 1)