app/controllers/sessions_controller.rb

  def create
    @user = User.find(:first ,
                       :conditions => ["login = ? and password = ?",
                                      params[:login][:username].capitalize!, params[:login][:password]])
---
SELECT * FROM `users` WHERE (login = 'Marco' and password = '123') LIMIT 1